{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-CONST_DIR",
    "1": "B-LIMIT",
    "2": "B-OBJ_DIR",
    "3": "B-OBJ_NAME",
    "4": "B-PARAM",
    "5": "B-VAR",
    "6": "I-CONST_DIR",
    "7": "I-LIMIT",
    "8": "I-OBJ_NAME",
    "9": "I-PARAM",
    "10": "I-VAR",
    "11": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONST_DIR": 0,
    "B-LIMIT": 1,
    "B-OBJ_DIR": 2,
    "B-OBJ_NAME": 3,
    "B-PARAM": 4,
    "B-VAR": 5,
    "I-CONST_DIR": 6,
    "I-LIMIT": 7,
    "I-OBJ_NAME": 8,
    "I-PARAM": 9,
    "I-VAR": 10,
    "O": 11
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.51.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
